# FamilyValidationResult Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..FamilyValidationResult Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Family Validation Warning(s): [Description]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FamilyValidationResult { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyValidationResult As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FamilyValidationResult {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace